01  WS-DATA-AREA.
    05  WS-AMOUNT PIC 9(5)V99 VALUE 0.
    05  WS-FLAG PIC X VALUE 'N'.
    05  WS-ERROR-FLAG PIC X VALUE 'N'.

PROCEDURE DIVISION.

    PERFORM 100-INPUT-DATA.
    IF WS-ERROR-FLAG = 'N'
       PERFORM 200-PROCESS-DATA.
       PERFORM 300-OUTPUT-DATA
    ELSE
       DISPLAY "Error: Invalid input amount."
    END-IF
    STOP RUN.

100-INPUT-DATA SECTION.
    DISPLAY "Enter amount:".
    ACCEPT WS-AMOUNT.
    IF WS-AMOUNT > 99999.99 THEN
        MOVE 'Y' TO WS-ERROR-FLAG
    END-IF.

200-PROCESS-DATA SECTION.
    IF WS-AMOUNT > 1000 THEN
        MOVE 'Y' TO WS-FLAG
    ELSE
        MOVE 'N' TO WS-FLAG
    END-IF.

300-OUTPUT-DATA SECTION.
    DISPLAY "Processed data:"
    DISPLAY WS-AMOUNT
    DISPLAY WS-FLAG
    GOBACK.